Ebiroll/qemu-xtensa-esp32/hw/arm/nrf51_radio_comm.c
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/boards.h"
#include "hw/arm/arm.h"
#include "qemu-common.h"
#include "cpu.h"
#include "hw/arm/arm.h"
#include "exec/address-spaces.h"
#include "qapi/error.h"
#include "hw/misc/unimp.h"
#include "hw/ptimer.h"
#include "sysemu/sysemu.h"
#include "nrf51.h"
#include "nrf51_radio.h"
#include "sys/socket.h"
#include "nrf51_helper.h"

/* NOTES From Ref Manual *//*

17.1.3 Maximum packet length
Independent of the configuration of MAXLEN, the combined length of S0, LENGTH, S1 and PAYLOAD cannot exceed 254 bytes.

*//* NOTES END */

/* Defines */

//FIXME: Implement all shorts
#define SHORT_READY_START(s) ((s)->REG.SHORTS & 0x1)
#define SHORT_END_DISABLE(s) ((s)->REG.SHORTS & 0x2)
#define SHORT_DISABLED_TXEN(s) ((s)->REG.SHORTS & (1 << 2))
#define SHORT_DISABLED_RXEN(s) ((s)->REG.SHORTS & (1 << 3))
#define SHORT_END_START(s) ((s)->REG.SHORTS & (1 << 5))

/* Types */
typedef void(*state_func_t)(nrf51_radio_state*s);

/* Static Functions */
static void nrf51_radio_save_conf(nrf51_radio_state *s);
static void nrf51_radio_timer_start(nrf51_radio_state *s, bool run_first);
static void nrf51_radio_timer_stop(nrf51_radio_state * s);
static const char * task_to_str(radio_task_t task);
static const char * state_to_str(NRF51_RADIO_STATE state);
static void nrf51_radio_task_txen(nrf51_radio_state *s);
static void nrf51_radio_task_rxen(nrf51_radio_state *s);
static int nrf51_radio_udp_send(nrf51_radio_state * s, nrf51_air_packet_buff * pkt);
static void nrf51_radio_pulse_event(const nrf51_radio_state * s, uint32_t mask);
static void nrf51_radio_event_loop(void *opaque);

static bool fire_event_disabled(nrf51_radio_state *s);
static void state_disabled(nrf51_radio_state *s);
static void state_rxtxru(nrf51_radio_state *s);
static void state_rx(nrf51_radio_state *s);
static void state_tx(nrf51_radio_state *s);
static void state_rxtxidle(nrf51_radio_state *s);
static void state_rxtxdisable(nrf51_radio_state *s);
static void check_pending_task(nrf51_radio_state * const s);

/* Static Globals */
static nrf51_air_packet_buff air_packet;
static const state_func_t state_fns[] =
{
    [enmStateDisabled] = state_disabled,
    [enmStateRxRu] = state_rxtxru,
    [enmStateRxIdle] = state_rxtxidle,
    [enmStateRx] = state_rx,
    [enmStateRxDisable] = state_rxtxdisable,
    [enmStateTxRu] = state_rxtxru,
    [enmStateTxIdle] = state_rxtxidle,
    [enmStateTx] = state_tx,
    [enmStateTxDisable] = state_rxtxdisable,
};
static QemuMutex mtx_console;
static QemuMutex mtx_radio;

static void nrf51_radio_reset(nrf51_radio_state *s)
{
    //Reset anything starting from radio_state field up to REG.
    memset(&s->radio_state, 0x00,
            offsetof(nrf51_radio_state, REG) - offsetof(nrf51_radio_state, radio_state));
    memset(&s->REG, 0x00, sizeof(s->REG));

    s->REG.FREQUENCY = 2;
    s->REG.DATAWHITEIV = (1<<6); //FIXME: Bit-6 is hardwired to 1!!!!
    nrf51_radio_timer_stop(s);
}

/*
 * read op shall only be called by QEMU.
 * It is protected by mutex.
 */
uint64_t nrf51_radio_read(void *opaque, hwaddr offset,
                          unsigned size)
{
    nrf51_radio_state *s = opaque;

    RAD_LOCK();

    RDP("rd [%20s] 0x%x", regtostr((uint32_t)offset), (uint32_t) offset);

    if (offset == O_RADIO_READY) RDP("ready: %u\n", s->REG.READY);

    switch(offset)
    {
        /* Events */
        case O_RADIO_READY:     RAD_UNLOCK_RET(s->REG.READY);
        case O_RADIO_END:       RAD_UNLOCK_RET(s->REG.END);
        case O_RADIO_PAYLOAD:   RAD_UNLOCK_RET(s->REG.PAYLOAD);
        case O_RADIO_ADDRESS:   RAD_UNLOCK_RET(s->REG.ADDRESS);
        case O_RADIO_DISABLED:  RAD_UNLOCK_RET(s->REG.DISABLED);
        case O_RADIO_DEVMATCH:  RAD_UNLOCK_RET(s->REG.DEVMATCH);
        case O_RADIO_DEVMISS:   RAD_UNLOCK_RET(s->REG.DEVMISS);
        case O_RADIO_RSSIEND:   RAD_UNLOCK_RET(1);//s->REG.RSSIEND;
        case O_RADIO_BCMATCH:   RAD_UNLOCK_RET(s->REG.BCMATCH);

        /* Registers */
        case O_RADIO_INTENSET:
        case O_RADIO_INTENCLR:
            RAD_UNLOCK_RET(s->REG.INTEN);

        case O_RADIO_STATE:     RAD_UNLOCK_RET(s->radio_state); //TODO: Use REG.STATE?
        case O_RADIO_TIFS:      RAD_UNLOCK_RET(s->REG.TIFS); //Has no effect in QEMU.
        case O_RADIO_SHORTS:    RAD_UNLOCK_RET(s->REG.SHORTS);
        case O_RADIO_CRCSTATUS: RAD_UNLOCK_RET(s->REG.CRCSTATUS);
        case O_RADIO_CRCCNF:    RAD_UNLOCK_RET(s->REG.CRCCNF);
        case O_RADIO_RXMATCH:   RAD_UNLOCK_RET(s->REG.RXMATCH);
        case O_RADIO_RXCRC:     RAD_UNLOCK_RET(s->REG.RXCRC);
        case O_RADIO_PACKETPTR: RAD_UNLOCK_RET(s->REG.PACKETPTR);
        case O_RADIO_FREQUENCY: RAD_UNLOCK_RET(s->REG.FREQUENCY);
        case O_RADIO_POWER:     RAD_UNLOCK_RET(s->REG.POWER);
        case O_RADIO_PCNF0:     RAD_UNLOCK_RET(s->REG.PCNF0);
        case O_RADIO_PCNF1:     RAD_UNLOCK_RET(s->REG.PCNF1);
        case O_RADIO_TXPOWER:   RAD_UNLOCK_RET(s->REG.TXPOWER);
        case O_RADIO_MODE:      RAD_UNLOCK_RET(s->REG.MODE);
        case O_RADIO_BASE0:     RAD_UNLOCK_RET(s->REG.BASE0);
        case O_RADIO_BASE1:     RAD_UNLOCK_RET(s->REG.BASE1);
        case O_RADIO_RXADDRESSES: RAD_UNLOCK_RET(s->REG.RXADDRESSES);
        case O_RADIO_DATAWHITEIV: RAD_UNLOCK_RET(s->REG.DATAWHITEIV);
        case O_RADIO_BCC:       RAD_UNLOCK_RET(s->REG.BCC);
        case O_RADIO_DACNF:     RAD_UNLOCK_RET(s->REG.DACNF);
        case O_RADIO_DAI:       RAD_UNLOCK_RET(s->REG.DAI);
        case O_RADIO_RSSISAMPLE: RAD_UNLOCK_RET(67);
    }

    RDP("RD not implemented: 0x%x", (unsigned int) offset);
    RAD_UNLOCK();
    return (uint64_t) -1;
}

/*
 * write op shall only be called by QEMU.
 * It is protected by mutex.
 */
void nrf51_radio_write(void *opaque, hwaddr offset,
                       uint64_t value, unsigned size)
{
    nrf51_radio_state *s = opaque;

    RAD_LOCK();

    switch (offset)
    {
        /* Events */
        case O_RADIO_END:       s->REG.END      = value; break;
        case O_RADIO_READY:     s->REG.READY    = value; break;
        case O_RADIO_PAYLOAD:   s->REG.PAYLOAD  = value; break;
        case O_RADIO_ADDRESS:   s->REG.ADDRESS  = value; break;
        case O_RADIO_DEVMISS:   s->REG.DEVMISS  = value; break;
        case O_RADIO_RSSIEND:   s->REG.RSSIEND  = value; break;
        case O_RADIO_DISABLED:  s->REG.DISABLED = value; break;
        case O_RADIO_DEVMATCH:  s->REG.DEVMATCH = value; break;
        case O_RADIO_BCMATCH:   s->REG.BCMATCH  = value; break;

        /* Registers */
        case O_RADIO_INTENSET:
            s->REG.INTEN |= value;
            break;

        case O_RADIO_INTENCLR:
            s->REG.INTEN &= ~value;
            break;

        case O_RADIO_PACKETPTR:
            //TODO: check that ptr is in Data RAM otherwise give HardFault.
            //Check 5.1 for memory regions.
            //Byte aligned RAM address.
            s->REG.PACKETPTR = value;
            break;

        case O_RADIO_FREQUENCY:
            //TODO: Allowed value is [0..100]. Need to check?
            if (value > 100)
                printf("error: frequency value too big: %llu", value);
            s->REG.FREQUENCY = value;
            RDP("set freq: %u", (unsigned int) value + 2400);
            break;

        case O_RADIO_POWER:
            if ( !(value & 0x1) )
            {
                //Reset device state.
                nrf51_radio_reset(s);
            }
            s->REG.POWER = !!value;
            break;

        case O_RADIO_SHORTS:
            s->REG.SHORTS = value;
            break;

        case O_RADIO_PCNF0:
            s->REG.PCNF0 = value;
            break;

        case O_RADIO_PCNF1:
            s->REG.PCNF1 = value;
            //Other configuration values are acquired during START task.
            s->ActiveConf.PCNF1.MAXLEN = PCNF1_MAXLEN_READ(s->REG.PCNF1);
            s->ActiveConf.PCNF1.WHITEEN = PCNF1_WHITEEN_READ(s->REG.PCNF1);
            break;

        case O_RADIO_TXPOWER:
            //Ineffective in QEMU.
            s->REG.TXPOWER = value;
            break;

        case O_RADIO_MODE:
            s->REG.MODE = value & 0x3;
            break;

        case O_RADIO_PREFIX0:
            s->REG.PREFIX0 = value;
            break;

        case O_RADIO_PREFIX1:
            s->REG.PREFIX1 = value;
            break;

        case O_RADIO_BASE0:
            s->REG.BASE0 = value;
            break;

