Ebiroll/qemu-xtensa-esp32/hw/arm/nrf51_radio_comm.c
        case O_RADIO_BASE1:
            s->REG.BASE1 = value;
            break;

        case O_RADIO_TXADDRESS:
            s->REG.TXADDRESS = value & 0x7;
            break;

        case O_RADIO_RXADDRESSES:
            s->REG.RXADDRESSES = value & 0xff;
            break;

        case O_RADIO_CRCCNF:
            s->REG.CRCCNF = value & 0x1ff; //TODO: Do bit mask? What is the device behavior?
            break;

        case O_RADIO_CRCINIT:
            s->REG.CRCINIT = value & 0xFFFFFF;
            break;

        case O_RADIO_CRCPOLY:
            s->REG.CRCPOLY = value & 0xFFFFFF;
            break;

        case O_RADIO_TIFS: //Has no effect in QEMU.
            s->REG.TIFS = value;
            break;

        case O_RADIO_DATAWHITEIV:
            s->REG.DATAWHITEIV = (1<<6) | (value & 0x3f);
            break;

        case O_RADIO_BCC:
            s->REG.BCC = value;
            break;

        case O_RADIO_DACNF:
            s->REG.DACNF = value;
            break;

        /* Tasks */
        case O_RADIO_TXEN:
            if (value) //TODO: check for == 1 or any value?
                nrf51_radio_task_txen(s);
            break;

        case O_RADIO_RXEN:
            if (value) //TODO: check for == 1 or any value?
                nrf51_radio_task_rxen(s);
            break;

        case O_RADIO_START:
            if (value)
            {
                g_assert(s->radio_task == enmTaskNone);
                s->radio_task = enmTaskStart;
                nrf51_radio_timer_start(s, true);
                //TODO: call timer func and return as well?
            }
            break;

        case O_RADIO_DISABLE:
            //if (s->radio_state == enmStateRxDisable || s->radio_state == enmStateTxDisable)
            if (s->radio_task != enmTaskNone && s->radio_task != enmTaskDisable)
            {
                RDP("error: a task is already running: %s", task_to_str(s->radio_task));
                g_assert(!"EXIT!");
            }
            s->radio_task = enmTaskDisable;
            //Run event loop and immediately disable radio
            nrf51_radio_timer_start(s, true);
            break;
//TODO: check for break; in switch statements in entire project.
        default:
            printf("[radio] WR not implemented: 0x%x\n", (unsigned int) offset);
            break;
    }

    RAD_UNLOCK();
}

static void nrf51_radio_task_txen(nrf51_radio_state *s)
{
    RDP("%s", "Trigger TXEN");
    //FIXME: get value in state handler (timer).
    s->ActiveConf.uFrequency = s->REG.FREQUENCY & 0x7f;
    //TODO: what is the decision point for MODE?
    s->ActiveConf.uMode = s->REG.MODE;

    if (s->radio_state != enmStateDisabled)
    {
        PRINT_INCORRECT_STATE();
    }

    if (s->radio_task != enmTaskNone)
    {
        RDP("error: a task is already running: %s", task_to_str(s->radio_task));
        g_assert(!"EXIT");
    }
    s->radio_task = enmTaskTxEn;
    nrf51_radio_timer_start(s, true);
}

static void nrf51_radio_task_rxen(nrf51_radio_state *s)
{
    RDP("%s", "Trigger RXEN");
    s->ActiveConf.uFrequency = s->REG.FREQUENCY & 0x7f;
    //TODO: what is the decision point for MODE?
    s->ActiveConf.uMode = s->REG.MODE;
    g_assert(s->radio_state == enmStateDisabled);
    if (s->radio_task != enmTaskNone)
    {
        RDP("error: a task is already running: %s", task_to_str(s->radio_task));
        g_assert(!"EXIT");
    }
    s->radio_task = enmTaskRxEn;
    nrf51_radio_timer_start(s, true);
}

static void nrf51_radio_save_conf(nrf51_radio_state *s)
{
    int i,j;
    //Get address prefix (AP0..AP3)
    for (i = 0; i < 4; i++)
        s->ActiveConf.AP[i] = READ_MSB_BYTE(s->REG.PREFIX0, i);

    //Get address prefix (AP4..AP7)
    for (i = 0, j = 4; i < 4; i++, j++)
        s->ActiveConf.AP[j] = READ_MSB_BYTE(s->REG.PREFIX1, i);

    RDP("AP: %02x:%02x:%02x:%02x %02x:%02x:%02x:%02x",
        s->ActiveConf.AP[0], s->ActiveConf.AP[1],
        s->ActiveConf.AP[2], s->ActiveConf.AP[3],
        s->ActiveConf.AP[4], s->ActiveConf.AP[5],
        s->ActiveConf.AP[6], s->ActiveConf.AP[7]);

    //Save base addresses
    s->ActiveConf.BASE[0] = s->REG.BASE0;
    s->ActiveConf.BASE[1] = s->REG.BASE1;
    RDP("BASE0: 0x%x, BASE1: 0x%x", s->REG.BASE0, s->REG.BASE1);

    //Save address select
    s->ActiveConf.uTxAddrSelect = s->REG.TXADDRESS;
    RDP_DUMP(s->ActiveConf.uTxAddrSelect);

    //Save RX address enable bits.
    for (int i = 0; i < 8; i++)
    {
        //Extract ADDRx enable bits from register.
        s->ActiveConf.RXADDRESSES_ADDR[i] = GET_BIT(s->REG.RXADDRESSES, i);
//        RDP_DUMP(s->ActiveConf.RXADDRESSES_ADDR[i]);
    }

    //Save PCNF0 values
    s->ActiveConf.PCNF0.LFLEN = s->REG.PCNF0 & 0xf;
    s->ActiveConf.PCNF0.S0LEN = s->REG.PCNF0 >> 8 & 0x1;
    s->ActiveConf.PCNF0.S1LEN = s->REG.PCNF0 >> 16 & 0xf;

    RDP("PCNF0 {LFLEN: %u, S0LEN: %u, S1LEN: %u}",
        s->ActiveConf.PCNF0.LFLEN,
        s->ActiveConf.PCNF0.S0LEN,
        s->ActiveConf.PCNF0.S1LEN);

    //Save PCNF1 values
    s->ActiveConf.PCNF1.STATLEN = s->REG.PCNF1 & 0xff;
    s->ActiveConf.PCNF1.BALEN = (s->REG.PCNF1 >> 16) & 0x7;
    s->ActiveConf.PCNF1.ENDIAN = GET_BIT(s->REG.PCNF1, 24); //TODO: do conversion in packet later.

    RDP_DUMP(s->ActiveConf.PCNF1.STATLEN);
    RDP_DUMP(s->ActiveConf.PCNF1.BALEN);
    RDP_DUMP(s->ActiveConf.PCNF1.ENDIAN);
    //This value is active as soon as it is written to PCNF1;
    RDP_DUMP(s->ActiveConf.PCNF1.MAXLEN);

    //Save CRCCNF, CRCINIT, CRCPOLY
    s->ActiveConf.CRCCNF.uLen = s->REG.CRCCNF & 0x3;
    s->ActiveConf.CRCCNF.bSkipAddr = GET_BIT(s->REG.CRCCNF, 8);
    s->ActiveConf.CRCINIT = s->REG.CRCINIT;
    s->ActiveConf.CRCPOLY = s->REG.CRCPOLY;

    RDP("CRCCNF {LEN: %u, SKIPADDR: %u}",
        s->ActiveConf.CRCCNF.uLen,
        s->ActiveConf.CRCCNF.bSkipAddr);
    RDP("CRCINIT: 0x%x, CRCPOLY: 0x%x",
        s->ActiveConf.CRCINIT,
        s->ActiveConf.CRCPOLY);

    s->ActiveConf.PACKETPTR = s->REG.PACKETPTR;
}

static void nrf51_radio_timer_reload(nrf51_radio_state * s, int ns)
{
    if (!s->qtimer)
    {
        s->qtimer = timer_new_ns(QEMU_CLOCK_VIRTUAL, nrf51_radio_timer, s);
    }

    const int64_t expire = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) +
            ((ns > 0) ? ns : (NANOSECONDS_PER_SECOND / 8192 * 1000));
    timer_mod_ns(s->qtimer, expire);
}

void nrf51_complete_irq_17(void * opaque)
{
    nrf51_radio_state * const s = opaque;
    RDP("%s","IRQ 17 Complete");
    RAD_LOCK();
    s->irq17_pending = false;
    if (s->timer_running)
    {
        nrf51_radio_timer_reload(s, 1);
    }
    RAD_UNLOCK();
}

