Ebiroll/qemu-xtensa-esp32/hw/arm/nrf51_radio_comm.c
static void nrf51_radio_timer_start(nrf51_radio_state *s, bool run_first)
{
    if (!s->REG.POWER)
        return;

    if (s->timer_running)
    {
        return;
    }

    if (run_first)
    {
        s->timer_running = true; //TODO: added for testing, avoids assert.
        nrf51_radio_event_loop(s);
    }

    s->timer_running = true;
    nrf51_radio_timer_reload(s, 0);

    RDP("%s", "timer running");
}

static void nrf51_radio_timer_stop(nrf51_radio_state * s)
{
    if (!s->timer_running)
        RDP("warning: %s", "timer was not running");

    s->timer_running = false;

    RDP("%s", "timer stopped");
}

static bool fire_event_disabled(nrf51_radio_state *s)
{
    bool kill_timer = true;
    g_assert(s->radio_task == enmTaskNone);
    switch (s->radio_state)
    {
        case enmStateDisabled:
            g_assert(!(SHORT_DISABLED_RXEN(s) && SHORT_DISABLED_TXEN(s)));
            if (SHORT_DISABLED_RXEN(s))
            {
                RDP("%s (%u)", "set (S) DISABLED->RXEN", s->next_on_disabled);
                g_assert(s->next_on_disabled == enmTaskNone); //guest error
                s->next_on_disabled = enmTaskRxEn;
                kill_timer = false;
            }
            else if (SHORT_DISABLED_TXEN(s))
            {
                RDP("%s (%u)", "set (S) DISABLED->TXEN", s->next_on_disabled);
                g_assert(s->next_on_disabled == enmTaskNone); //guest error
                s->next_on_disabled = enmTaskTxEn;
                kill_timer = false;
            }
            else
            {
                //DISABLED fired from DISABLED state.
                //Cancel if there is a pending RxEn/TxEn task.
                s->next_on_disabled = enmTaskNone;
            }
            
            break;
        default:
            PRINT_INCORRECT_STATE();
            g_assert(!"incorrect state in fire event disabled");
            break;
    }

    s->REG.DISABLED = 1;
    s->irq17_pending = true;
    RDP("%s", "event DISABLED");
    nrf51_radio_pulse_event(s, RADIO_INTEN_DISABLED);

    return !kill_timer;
}

static const char * task_to_str(radio_task_t task)
{
    switch(task)
    {
        case enmTaskNone: return "NONE";
        case enmTaskTxEn: return "TXEN";
        case enmTaskRxEn: return "RXEN";
        case enmTaskStart: return "START";
        case enmTaskStop: return "STOP";
        case enmTaskDisable: return "DISABLE";
        default:
            return "UNK";
    }
}

static const char * state_to_str(NRF51_RADIO_STATE state)
{
    switch (state)
    {
        case enmStateDisabled: return "DISABLED";
        case enmStateRxRu: return "RXRU";
        case enmStateRxIdle: return "RXIDLE";
        case enmStateRx: return "RX";
        case enmStateTxRu: return "TXRU";
        case enmStateTxIdle: return "TXIDLE";
        case enmStateTx: return "TX";
        case enmStateRxDisable: return "RXDISABLE";
        case enmStateTxDisable: return "TXDISABLE";
        default:
            return "UNK";
    }
}

static int nrf51_radio_udp_send(nrf51_radio_state * s, nrf51_air_packet_buff * pkt)
{
    int udp_sz, sent;
    udp_sz = udp_read_len(&pkt->proto_hdr) + PROTO_HDR_SZ;
    sent = nrf51_udp_send((uint8_t*)pkt, udp_sz);
    if (sent == -1)
    {
        RDP("%s", "unable to send udp packet");
        return -1;
    }

    return sent;
}

void nrf51_radio_udp_init(nrf51_radio_state *s)
{
    qemu_mutex_init(&mtx_console);
    qemu_mutex_init(&mtx_radio);
}

static void nrf51_radio_pulse_event(const nrf51_radio_state * s, uint32_t mask)
{
    if (s->REG.INTEN & mask)
        qemu_irq_pulse(s->irq);
}

void nrf51_radio_do_rx(void * opaque, uint8_t * data, uint_fast16_t len)
{
    nrf51_radio_state * s = opaque; //TODO: null check?
    nrf51_air_packet * pkt = (nrf51_air_packet*) data;

    RDP("%s", "data received");

    if ( len < (int) (PROTO_HDR_SZ + AIR_PACKET_HDR_SZ) )
    {
        RDP("%s", "header not received");
        //No data received.
        return;// false;
    }

    if (pkt->type != enmAirTypeData)
    {
        RDP("drop, unexpected packet type: %u", pkt->type);
        return;// false;
    }

    RAD_LOCK();

    const int packet_len = udp_read_len(&pkt->proto_hdr) - AIR_PACKET_HDR_SZ;

    if ( s->radio_task != enmTaskNone || s->radio_state != enmStateRx )
    {
        //Drop this packet. We don't expect any radio data.
        RDP("%s", "Not expecting radio packet, drop");
        goto fail;
    }

    RDP("data received pay len: %u, packet len: %u", packet_len, len);
    hexdump("RX payload", pkt->data_start, packet_len);

    //FIXME: Calculate target data space.
    //FIXME: Truncate packet based on MAXLEN, SLEN, etc. params.
    if (NRF51_OUT_OF_RAM(s->ActiveConf.PACKETPTR, 4 /*FIXME: calculate me*/))
    {
        RDP("packetptr: 0x%x", s->ActiveConf.PACKETPTR);
        nrf51_trigger_hardfault();
        goto fail;
    }

    address_space_write(&address_space_memory, s->ActiveConf.PACKETPTR /*+ 2*/, MEMTXATTRS_UNSPECIFIED,
                        pkt->data_start, packet_len);

    s->REG.PAYLOAD = 1;
    RDP("%s", "event PAYLOAD");
    nrf51_radio_pulse_event(s, RADIO_INTEN_PAYLOAD);
    //FIXME: Do CRC operation. and IRQ?
    s->REG.CRCSTATUS = 1;

    s->REG.END = 1;
    RDP("%s", "event END");
    nrf51_radio_pulse_event(s, RADIO_INTEN_END);

    if (SHORT_END_DISABLE(s) && SHORT_END_START(s))
    {
        qemu_log_mask(LOG_GUEST_ERROR,
            "[RADIO] Rx: END_DISABLE & END_START are enabled at the same time.");
        RDP("guest error: %s", "disable timer");
        nrf51_radio_timer_stop(s);
        goto fail;
    }

    if (SHORT_END_DISABLE(s))
    {
        s->radio_task = enmTaskDisable;
    }
    else if (SHORT_END_START(s))
    {
        s->radio_task = enmTaskStart;
    }
    else
    {
        s->radio_state = enmStateRxIdle;
    }

    //Run the state machine. For immediate state transition.
    //Keep the timer running.
    nrf51_radio_timer_start(s, true);

    //Fall-through works but this is safer for possible future modifications
    RAD_UNLOCK();
    return;

