Ebiroll/qemu-xtensa-esp32/hw/arm/nrf51_radio_comm.c
fail:
    RAD_UNLOCK();
    //return true;
}

static void nrf51_radio_do_tx(nrf51_radio_state * s)
{
    unsigned int uHdrSize = 0;
    uint8_t achHdr[3];
    unsigned int uLength;
    unsigned int uPayLen = 0;
    unsigned int uRawSize;

    g_assert(s->radio_task == enmTaskNone);

    RDP("sending data pointed at 0x%x", s->ActiveConf.PACKETPTR);

    //This is either 1 byte or none.
    if(s->ActiveConf.PCNF0.S0LEN)
        uHdrSize++;

    //If LFLEN exists and its size is smaller than 8 bits
    //it will occupy 1 byte in memory.
    if (s->ActiveConf.PCNF0.LFLEN)
        uHdrSize++;

    //Same as LFLEN
    if(s->ActiveConf.PCNF0.S1LEN)
        uHdrSize++;

    if (uHdrSize > 0)
    {
        if (NRF51_OUT_OF_RAM(s->ActiveConf.PACKETPTR, uHdrSize))
        {
            nrf51_trigger_hardfault();
            return;
        }

        address_space_read(&address_space_memory, s->ActiveConf.PACKETPTR,
                           MEMTXATTRS_UNSPECIFIED, achHdr, (int) uHdrSize);
        if (s->ActiveConf.PCNF0.LFLEN)
        {
            if(s->ActiveConf.PCNF0.S0LEN)
                uLength = achHdr[1]; //Skip S0 and read length field
            else
                uLength = achHdr[0];
            //Do bit mask for configured number of bits.
            uLength &= (1 << s->ActiveConf.PCNF0.LFLEN) - 1;
            uPayLen += uLength;
        }
    }

    //Static length = number of bytes to transmit AFTER payload.
    uPayLen += s->ActiveConf.PCNF1.STATLEN;
    uRawSize = uHdrSize + uPayLen;

    //Raw packet size cannot exceed 254 bytes
    //Ref. manual, 17.1.3 Maximum packet length
    if (uRawSize > 254)
        uRawSize = 254;

    RDP("raw size: %d", uPayLen);
    RDP("pkt header size: %u", uHdrSize);
    RDP("payload size: %d", uPayLen);

    if (uRawSize == 254)
    {
        //It might be required to adjust maximum payload size.
        uPayLen = uRawSize - uHdrSize;
    }

    //TODO: Not clear if MAXLEN limits the payload size or total packet size. Assuming payload size.
    if (uPayLen > s->ActiveConf.PCNF1.MAXLEN)
        uPayLen = s->ActiveConf.PCNF1.MAXLEN;

    RDP("adjusted payload size: %d", uPayLen);

    if (uPayLen)
    {
        uint8_t payload[uPayLen];
        int i;
        address_space_read(&address_space_memory, s->ActiveConf.PACKETPTR /*+ uHdrSize*/,
                           MEMTXATTRS_UNSPECIFIED, payload, (int) uPayLen + uHdrSize);
        RDP("%s", "payload data: ");
        for (i = 0; i < uPayLen; i++)
        {
            printf("%02x ", payload[i]);
        }
        printf("\n");

        //build packet for udp layer
        air_packet.type = enmAirTypeData;
        air_packet.mode = s->ActiveConf.uMode;
        nrf51_udp_fill_hdr(&air_packet.proto_hdr, PROTO_RADIO, AIR_PACKET_HDR_SZ + uPayLen);
        assert(uPayLen <= PBUF_SZ);
        memcpy(air_packet.buffer, payload , uPayLen);

        nrf51_radio_udp_send(s, &air_packet);
    }

    s->REG.PAYLOAD = 1;
    RDP("%s", "event PAYLOAD");
    nrf51_radio_pulse_event(s, RADIO_INTEN_PAYLOAD);

    //FIXME: Do CRC operation.
    s->REG.END = 1;
    RDP("%s", "event END");
    nrf51_radio_pulse_event(s, RADIO_INTEN_END);

    if (SHORT_END_DISABLE(s) && SHORT_END_START(s))
    {
        qemu_log_mask(LOG_GUEST_ERROR,
            "[RADIO] Tx: END_DISABLE & END_START are enabled at the same time.");
        RDP("guest error: %s", "disable timer");
        nrf51_radio_timer_stop(s);
        return;
    }

    //Set new state, following shorts may override it.
    s->radio_state = enmStateTxIdle;

    if (SHORT_END_DISABLE(s))
    {
        //This is disable task.
        s->radio_state = enmStateTxDisable;
        s->radio_task = enmTaskNone;
    }
    else if (SHORT_END_START(s))
    {
        s->radio_state = enmStateTxIdle;
        s->radio_task = enmTaskStart;
    }

    g_assert(s->timer_running);

    nrf51_radio_event_loop(s);
}

static void state_disabled(nrf51_radio_state *s)
{
    switch (s->radio_task)
    {
        case enmTaskTxEn:
            s->radio_state = enmStateTxRu;
            s->radio_task = enmTaskNone;
            nrf51_radio_event_loop(s);
            break;

        case enmTaskRxEn:
            s->radio_state = enmStateRxRu;
            s->radio_task = enmTaskNone;
            nrf51_radio_event_loop(s);
            break;

        case enmTaskDisable:
            s->radio_task = enmTaskNone;
            s->next_on_disabled = enmTaskNone; //DISABLE fired while in DISABLED state, so cancel next task.
            fire_event_disabled(s); //TODO: disabled event from disabled state? Is it correct?
            break;

        case enmTaskNone:
            //Timer not killed, should kill if no interrupt?
            break;

        default:
            PRINT_INCORRECT_STATE();
            nrf51_radio_timer_stop(s);
            break;
    }
}

static void state_rxtxru(nrf51_radio_state *s)
{
    switch (s->radio_task)
    {
       case enmTaskNone:
            RDP("event (%s) READY", (s->radio_state == enmStateRxRu)  ? "RX" : "TX");
            s->radio_state = (s->radio_state == enmStateRxRu)  ? enmStateRxIdle : enmStateTxIdle;
            s->REG.READY = 1;
            nrf51_radio_event_ready_ppi();
            nrf51_radio_pulse_event(s, RADIO_INTEN_READY);
            if (SHORT_READY_START(s))
            {
                s->radio_task = enmTaskStart;
                nrf51_radio_event_loop(s);
            }
            break;

        case enmTaskDisable:
            s->radio_task = enmTaskNone; //Finish task
            s->radio_state = enmStateRxDisable; //New state
            nrf51_radio_event_loop(s);
            break;

        default:
            PRINT_INCORRECT_STATE();
            nrf51_radio_timer_stop(s);
            break;
    }
}

static void state_rxtxidle(nrf51_radio_state *s)
{
    g_assert(s->radio_state == enmStateRxIdle || s->radio_state == enmStateTxIdle);

    switch (s->radio_task)
    {
        case enmTaskNone:
        {
            break;
        }

        case enmTaskStart:
        {
            nrf51_radio_save_conf(s);
            s->radio_task = enmTaskNone;

