Ebiroll/qemu-xtensa-esp32/hw/arm/nrf51_radio_comm.c
            if (s->radio_state == enmStateRxIdle)
            {
                s->radio_state = enmStateRx;
            }
            else //TxIdle
            {
                s->radio_state = enmStateTx;
            }
            nrf51_radio_event_loop(s);
            break;
        }

        case enmTaskDisable:
        {
            s->radio_task = enmTaskNone;
            s->radio_state = (s->radio_state == enmStateRxIdle) ?
                    enmStateRxDisable : enmStateTxDisable;
            nrf51_radio_event_loop(s);
            break;
        }

        default:
            PRINT_INCORRECT_STATE();
            nrf51_radio_timer_stop(s);
            break;
    }

    //No code should come here. (tail-rec call)
}

static void state_rx(nrf51_radio_state *s)
{
    switch(s->radio_task)
    {
        case enmTaskNone:
        {
            //Stay in RX state until packet is received
            break;
        }

        case enmTaskDisable:
        {
            s->radio_task = enmTaskNone;
            s->radio_state = enmStateRxDisable;
            nrf51_radio_event_loop(s);
            break;
        }

        default:
            PRINT_INCORRECT_STATE();
            nrf51_radio_timer_stop(s);
            break;
    }

    //tail-rec, nothing comes here
}

static void state_tx(nrf51_radio_state *s)
{
    switch(s->radio_task)
    {
        case enmTaskNone:
        {
            //state change handled by do_tx
            nrf51_radio_do_tx(s);
            //s->radio_state = enmStateTxIdle;
            break;
        }

        default:
            PRINT_INCORRECT_STATE();
            nrf51_radio_timer_stop(s);
            break;
    }
}

static void state_rxtxdisable(nrf51_radio_state *s)
{
    switch (s->radio_task)
    {
        case enmTaskNone:
        {
            s->radio_state = enmStateDisabled;
            fire_event_disabled(s);
            break;
        }

        default:
            PRINT_INCORRECT_STATE();
            nrf51_radio_timer_stop(s);
            break;
    }
}

static void check_pending_task(nrf51_radio_state * const s)
{

    if (s->radio_task == enmTaskDisable)
    {
        s->next_on_disabled = enmTaskNone;
        return;
    }

    //TODO: check if two shorts are enabled at the same time.
    if (s->next_on_disabled == enmTaskTxEn /*&& SHORT_DISABLED_TXEN(s)*/)
    {
        RDP("%s", "run (S) DISABLED->TXEN");
        s->next_on_disabled = enmTaskNone;
        nrf51_radio_task_txen(s);
    }
    else if (s->next_on_disabled == enmTaskRxEn /*&&  SHORT_DISABLED_RXEN(s)*/)
    {
        RDP("%s", "run (S) DISABLED->RXEN");
        s->next_on_disabled = enmTaskNone;
        nrf51_radio_task_rxen(s);
    }
    else
    {
        RDP("Next task was not run, shorts changed: 0x%x", s->REG.SHORTS);
    }

}

void nrf51_radio_timer(void *opaque)
{
    nrf51_radio_state * const s = opaque;
    RAD_LOCK();
    if(!s->timer_running)
    {
        RAD_UNLOCK();
        return;
    }

    if (s->irq17_pending)
    {
        nrf51_radio_timer_reload(s, 0);
        RAD_UNLOCK();
        return;
    }

    if (s->next_on_disabled != enmTaskNone)
    {
        check_pending_task(s);
    }

    nrf51_radio_event_loop(opaque);
    nrf51_radio_timer_reload(s, 0);

    RAD_UNLOCK();
}

static void nrf51_radio_event_loop(void *opaque)
{
    nrf51_radio_state * const s = opaque;

    if (!s->REG.POWER)
    {
        RDP("%s", "powered off, stop timer.");
        if (s->timer_running)
            nrf51_radio_timer_stop(s);
        s->radio_state = enmStateDisabled;
        s->radio_task = enmTaskNone;
        return;
    }

    {
        static int last;
        int now = (s->radio_state << 16) | s->radio_task;
        if (now != last)
        {
            RDP("current state: %s, task: %s", state_to_str(s->radio_state), task_to_str(s->radio_task));
            last = now;
        }
    }

    /* Implemented according to ref. manual v3.0 Figure 22: Radio states */
    /* RADIO does not prevent a task being triggered from wrong state (ref. manual 17.1.8 Radio States, p. 84) */

    const state_func_t fn = state_fns[s->radio_state];

    if (fn)
    {
        fn(s);
        return;
    }
    else
    {
            RDP("unknown radio state: %u (task: %u)",
                s->radio_state, s->radio_task);
            nrf51_radio_timer_stop(s);
    }

    //No code should come here. (tail-rec call)
}
